Revit 2027 API
GeomCombination.AllMembers Property
All elements that are joined in this geometry combination.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CombinableElementArray AllMembers { get; }
Public ReadOnly Property AllMembers As CombinableElementArray
	Get
public:
property CombinableElementArray^ AllMembers {
	CombinableElementArray^ get ();
}
member AllMembers : CombinableElementArray with get
Property Value
CombinableElementArray
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when this geometry combination has already been deleted.
Remarks
All members are generic forms, for more information, refer toGenericForm.
See Also
Reference
GeomCombination Class
Autodesk.Revit.DB Namespace